// Задача 64: Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.

int m = 1;
int n = 5;
for (; m <= n; m++) Console.Write($"{m} ");