// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

int a = 482;
int result = a%100;
Console.WriteLine("Вторая цифра числа = " + result/10);


