// Задача 7: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.

int a = 357;
int lustnumber = a%10;
Console.WriteLine("Последнее число: " + lustnumber);



// Версия для ручого ввода

//Console.WriteLine("Введите трёхзначное число");
//int a = Convert.ToInt32(Console.ReadLine());
//int lustnumber = a%10;
//Console.WriteLine("Последнее число: " + lustnumber);



