// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).


int a = 4;

if (a%2 == 0)
{
    Console.WriteLine("Число четное");
    
}else   Console.WriteLine("Число нечетное");

//Ниже вариант для ручного ввода

// Console.WriteLine("Введите число");
// int a = Convert.ToInt32(Console.ReadLine());

// if (a%2 == 0)
// {
//     Console.WriteLine("Число четное");
    
// }else   Console.WriteLine("Число нечетное");