// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

int a = 3, b = 5;

if (a > b) {Console.WriteLine("Первое число больше и равняеться: " + a);}
else Console.WriteLine("Второе число больше и равняеться: " + b);

//Ниже вариант для ручного ввода

//Console.Write("Введите первое число:");
//int a = Convert.ToInt32(Console.ReadLine());
//Console.Write("Введите второе число:");
//int b = Convert.ToInt32(Console.ReadLine());

//if (a > b) {Console.WriteLine("Первое число больше и равняеться: " + a);}
//else Console.WriteLine("Второе число больше и равняеться: " + b);
